%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%Tile:a=1二维抛物线离散映射随不同参数b变化时的迭代序列     
%%%User:徐勝濤                                    
%%%Time:2019-8-26                                 
%%%Discript:                                      
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clear;clc
a=1;   b=1.51;
%b=1.72;
x(1)=0;y(1)=0.1;z(1)=0;w(1)=-0.1;
for n=1:501
    x(n+1)=a*(y(n))^2;
    y(n+1)=b*y(n)*(1-x(n));
    z(n+1)=a*(w(n)^2);
    w(n+1)=b*w(n)*(1-z(n));
    T(n)=n-1;
    I1(n)=y(n);
    I2(n)=w(n);
end
plot(T,I1,'k',T,I2,'g');
drawnow
