%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%Tile:a=10时一维广义平方映射随参数b变化的李雅普诺夫指数谱     
%%%User:徐勝濤                                    
%%%Time:2019-8-26                                 
%%%Discript:                                      
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

clear;clc
a=10;
for m=1:1001
    b=-1+0.002*(m-1);
    x(1)=0;
    for n=1:3000
        x(n+1)=b*exp(-a*x(n)*x(n))-b*x(n)*x(n);
        L1(n)=log(abs(-2*b*x(n)*(a*exp(-a*x(n)*x(n))+1)));
    end
    L2(m)=sum(L1(500:end))/2500;
    x1(m)=b;y1(m)=L2(m);
end
plot(x1,y1)