%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%Tile:二维离散映射参数随变化时最大李雅普诺夫指数     
%%%User:徐勝濤                                    
%%%Time:2019-8-26                                 
%%%Discript:                                      
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clear;clc
%a=1;  
b=1.8;
%for m=1:600
for m=1:500
    %b=0.8+0.002*(m-1);
    a=0.2+0.004*(m-1);
    x(1)=0;y(1)=0.1;
    j11(1)=1;j12(1)=0;j21(1)=0;j22(1)=1;
    for n=1:1000
        x(n+1)=a*(y(n))^2;
        y(n+1)=b*y(n)*(1-x(n));
        %%求Jacobi矩阵元素
        j1=0;
        j2=2*a*y(n);
        j3=-b*y(n);
        j4=b*(1-x(n));
        %%与前一个雅可比矩阵相乘
        j11(n+1)=j1*j11(n)+j2*j21(n);
        j12(n+1)=j1*j12(n)+j2*j22(n);
        j21(n+1)=j3*j11(n)+j4*j21(n);
        j22(n+1)=j3*j12(n)+j4*j22(n);
    end
    J=[j11(end),j12(end);j21(end),j22(end)];
    z=max(abs(eig(J)));
    lya(m)=log(abs(real(z)))/1000;
end
%H=plot(0.8+0.002*((1:600)-1),lya(:));
H=plot(0.2+0.004*((1:500)-1),lya(:));
hold on
drawnow
    