%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%Tile:a=10,b为不同值时对应的一维离散映射函数       
%%%User:徐勝濤                                    
%%%Time:2019-8-26                                 
%%%Discript:                                      
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

clear;clc
a=10;
x=-1:0.001:1;
f1=1*(exp(-a*x.*x)-x.*x);
f2=0.7*(exp(-a*x.*x)-x.*x);
f3=0.4*(exp(-a*x.*x)-x.*x);
f4=-0.4*(exp(-a*x.*x)-x.*x);
f5=-0.7*(exp(-a*x.*x)-x.*x);
f6=-1*(exp(-a*x.*x)-x.*x);
f7=x;
plot(x,f1,x,f2,x,f3,x,f4,x,f5,x,f6,x,f7)