%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%Tile:二维抛物线离散映射吸引子随参数b变化的演变过程     
%%%User:徐勝濤                                    
%%%Time:2019-8-27                                 
%%%Discript:                                      
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clear;clc
a=1;
%b=1.5;
%b=1.51;
%b=1.6;
%b=1.71;
%b=1.72;
%b=1.8;
%b=1.86;
%b=1.92;
b=1.99;
x(1)=0;y(1)=0.1;z(1)=0;w(1)=-0.1;
for n=1:40000
    x(n+1)=a*(y(n)^2);
    y(n+1)=b*y(n)*(1-x(n));
    z(n+1)=a*(w(n)^2);
    w(n+1)=b*w(n)*(1-z(n));
end
H=plot(x(1000:end),y(1000:end),'r',z(1000:end),w(1000:end),'g');
set(H,'linestyle','none','marker','.','markersize',1)
%hold on
%drawnow